<?php

namespace Blog\NewsBundle\DataFixtures\ORM;

use Doctrine\Common\DataFixtures\FixtureInterface;
use Doctrine\Common\Persistence\ObjectManager;

class LoadCommentData implements FixtureInterface
{
    public function load(ObjectManager $manager)
    {
        $objects = \Nelmio\Alice\Fixtures::load(
            __DIR__ . '/comment.yml',
            $manager, array(
                'providers' => array($this)
            )
        );
    }

    public function comments()
    {
        $comments = array(
            '«Коментарі» знайомлять читачів із найцікавішими прем´єрами в українському кінопрокаті',
            '«Коментарі» знайомлять читачів із найцікавішими прем´єрами в українському кінопрокаті',
            '«Коментарі» знайомлять читачів із найцікавішими прем´єрами в українському кінопрокаті',
            '«Коментарі» знайомлять читачів із найцікавішими прем´єрами в українському кінопрокаті',
            'Благородні пориви, які прийнято називати «волею Майдану», можуть перетворюватися в позбавлену будь-якого пафосу буденність і навіть у мовн',
            'Благородні пориви, які прийнято називати «волею Майдану», можуть перетворюватися в позбавлену будь-якого пафосу буденність і навіть у мовн',
            'Благородні пориви, які прийнято називати «волею Майдану», можуть перетворюватися в позбавлену будь-якого пафосу буденність і навіть у мовн',
            'Благородні пориви, які прийнято називати «волею Майдану», можуть перетворюватися в позбавлену будь-якого пафосу буденність і навіть у мовн',
            'Благородні пориви, які прийнято називати «волею Майдану», можуть перетворюватися в позбавлену будь-якого пафосу буденність і навіть у мовн',
            'Майбутнім абітурієнтам слід дуже уважно ознайомитися з умовами вступної кампанії, щоб пройти її легко й успішно',
            'Майбутнім абітурієнтам слід дуже уважно ознайомитися з умовами вступної кампанії, щоб пройти її легко й успішно',
            'Майбутнім абітурієнтам слід дуже уважно ознайомитися з умовами вступної кампанії, щоб пройти її легко й успішно',
            'Майбутнім абітурієнтам слід дуже уважно ознайомитися з умовами вступної кампанії, щоб пройти її легко й успішно',
            'У рамках децентралізації громади отримають максимально широкі повноваження',
            'У рамках децентралізації громади отримають максимально широкі повноваження',
            'У рамках децентралізації громади отримають максимально широкі повноваження',
            'У рамках децентралізації громади отримають максимально широкі повноваження',
        );

        return $comments[array_rand($comments)];
    }
}
